#+title: Coder On Pair
#+PROPERTY: header-args:bash+ :session coder :noweb yes

* Create Coder namespace
We will have all our necessary components(postgres, coder) installed into a single namespace named coder.

#+begin_src zsh
kubectl create namespace coder
#+end_src

#+RESULTS:
: namespace/coder created

** Validate it is all set up
We should have postgres up and running in our coder namespace.
#+begin_src bash :results output
kubectl -n coder get pods
#+end_src

#+RESULTS:
: NAME                    READY   STATUS    RESTARTS   AGE
: postgres-postgresql-0   1/1     Running   0          17m

** Validate it is up
#+begin_src bash
kubectl -n coder get pods
#+end_src

#+RESULTS:
| NAME                  | READY | STATUS  | RESTARTS | AGE |
| coder-c9dccbc9f-hhf25 | 1/1   | Running |        0 | 6s  |
| postgres-postgresql-0 | 1/1   | Running |        0 | 71m |

